logsource:
  category: process_creation
  product: windows
detection:
  selection_plain:
    CommandLine|contains:
    - ' -NoP '
    - ' -W Hidden '
    - ' -decode '
    - ' /decode '
    - ' -e* JAB'
    - ' -e* SUVYI'
    - ' -e* SQBFAFgA'
    - ' -e* aWV4I'
    - ' -e* IAB'
    - ' -e* PAA'
    - ' -e* aQBlAHgA'
    - vssadmin delete shadows
    - reg SAVE HKLM\SAM
    - ' -ma '
    - Microsoft\Windows\CurrentVersion\Run
    - .downloadstring(
    - .downloadfile(
    - ' /ticket:'
    - ' sekurlsa'
    - ' p::d '
    - ;iex(
    - schtasks* /create *AppData
    - ' comsvcs.dll,MiniDump'
    - ' comsvcs.dll,#24'
    - ' comsvcs.dll MiniDump'
    - ' comsvcs.dll #24'
    - ' comsvcs `#'
    - ' comsvcs #'
    - ' comsvcs MiniDump'
    - .dmp full
  selection_parent_child:
    ParentImage|contains:
    - \WINWORD.EXE
    - \EXCEL.EXE
    - \POWERPNT.exe
    - \MSPUB.exe
    - \VISIO.exe
    - \OUTLOOK.EXE
    Image|contains:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    - \wscript.exe
    - \cscript.exe
    - \schtasks.exe
    - '*\scrcons.exe'
    - \regsvr32.exe
    - \hh.exe
    - \wmic.exe
    - \mshta.exe
    - \msiexec.exe
    - \forfiles.exe
    - \AppData\
  selection_webshells:
    Image|contains:
    - \apache*
    - \tomcat*
    - \w3wp.exe
    - \php-cgi.exe
    - \nginx.exe
    - \httpd.exe
    CommandLine|contains:
    - whoami
    - 'net user '
    - 'ping -n '
    - systeminfo
    - '&cd&echo'
    - 'cd /d '
  selection_whoami:
    Image|contains: \whoami.exe
    User|contains:
    - AUTHORI
    - AUTORI
  condition: 1 of them
